src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗаказКлиента/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Склад) Тогда
		Склад = Константы.ОсновнойСклад.Получить();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаОтгрузки) Тогда
		ДатаОтгрузки = НачалоДня(ТекущаяДатаСеанса()) + 86400;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЗначениеЗаполнено(ДатаОтгрузки) И ДатаОтгрузки < НачалоДня(Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Дата отгрузки не может быть раньше даты заказа'"),
			Ссылка, "ДатаОтгрузки", "Объект", Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЦенообразованиеСервер.ЗаполнитьЦеныИПересчитатьСуммы(ЭтотОбъект);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Статус = Перечисления.СтатусыЗаказовКлиентов.Новый;
	ДатаОтгрузки = НачалоДня(ТекущаяДатаСеанса()) + 86400;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения заказа зависят от статуса:
	//  Новый      - остаток к отгрузке = заказано, резерва нет;
	//  К отгрузке - остаток к отгрузке = заказано, товары резервируются на складе;
	//  Закрыт     - остаток к отгрузке и резерв приравниваются к уже использованному отгрузками,
	//               т.е. по заказу больше ничего не ждет отгрузки и ничего не лежит в резерве.
	// Реализации по заказу списывают и остаток к отгрузке, и резерв - поэтому при любом статусе
	// приход по заказу не может быть меньше уже отгруженного (контролируется после записи).

	ПроведениеСервер.ПодготовитьНаборыЗаписей(ЭтотОбъект);

	Данные = Документы.ЗаказКлиента.ДанныеДляПроведения(Ссылка);

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ЗаказыКлиентов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ЗаказКлиента", Ссылка);
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыВРезерве");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ЗаказКлиента", Ссылка);
	Блокировка.Заблокировать();

	РезервироватьТовары = (Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	Если РезервироватьТовары Тогда
		ПроведениеСервер.ЗаблокироватьСкладскиеОстатки(Данные.ТоварыНаСкладе, Ложь);
	КонецЕсли;

	Использовано = Документы.ЗаказКлиента.ИспользованоПоЗаказу(Ссылка);

	// Остаток к отгрузке
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		ТоварыКОтгрузке = Использовано.Отгружено;
	Иначе
		ТоварыКОтгрузке = Данные.Товары;
	КонецЕсли;
	Для Каждого СтрокаТоваров Из ТоварыКОтгрузке Цикл
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗаказКлиента = Ссылка;
		Движение.Номенклатура = СтрокаТоваров.Номенклатура;
		Движение.Количество = СтрокаТоваров.Количество;
		Движение.Сумма = СтрокаТоваров.Сумма;
	КонецЦикла;

	// Резерв
	Если РезервироватьТовары Тогда
		ТоварыВРезерв = Данные.ТоварыНаСкладе;
	Иначе
		ТоварыВРезерв = Использовано.СнятоРезерва;
	КонецЕсли;
	Для Каждого СтрокаТоваров Из ТоварыВРезерв Цикл
		Движение = Движения.ТоварыВРезерве.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТоваров.Номенклатура;
		Движение.Склад = СтрокаТоваров.Склад;
		Движение.ЗаказКлиента = Ссылка;
		Движение.Количество = СтрокаТоваров.Количество;
	КонецЦикла;

	ПроведениеСервер.ЗаписатьДвижения(Движения.ЗаказыКлиентов);
	ПроведениеСервер.ЗаписатьДвижения(Движения.ТоварыВРезерве);

	Если РезервироватьТовары Тогда
		ПроведениеСервер.ПроверитьСвободныеОстатки(Данные.ТоварыНаСкладе, Ссылка, Отказ);
	КонецЕсли;
	ЗаказыКлиентовСервер.ПроверитьОстаткиПоЗаказу(Ссылка, Ссылка, Отказ);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	// По заказу уже могли отгрузить - тогда отмена проведения увела бы остатки заказа в минус.
	ПроведениеСервер.УдалитьДвижения(ЭтотОбъект);
	ЗаказыКлиентовСервер.ПроверитьОстаткиПоЗаказу(Ссылка, Ссылка, Отказ);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
